Autodesk.Navisworks.Api.Plugins.PluginOptions
Options that modify how a plugin behaves

Autodesk.Navisworks.Api.Plugins.PluginOptions.None
No additional options

Autodesk.Navisworks.Api.Plugins.PluginOptions.SupportsControls
Supports being used in a control (see Autodesk.Navisworks.Api.Controls)